# 다음 퀴즈를 수행하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [8]:
df = pd.read_csv("DS_lv1/class_scores.csv")
type(df)

pandas.core.frame.DataFrame

### Q3. df의 첫 3개 row를 출력하시오

In [4]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [5]:
df.tail(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

### Q5. df의 차원을 확인하시오

In [9]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [11]:
print(len(df))

600

### Q7. df의 column 개수를 확인하시오

In [14]:
df.shape[1]

9

### Q8. df의 column 이름을 확인하시오

In [15]:
df.columns

Index(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'],
      dtype='object')

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [16]:
df.head(2)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57

In [37]:
# df_sub = df.loc[["grade"] == 2].drop(["class", "gender"], axis = 1)
df_sub = df.iloc[: ,[0, 1, 4, 5, 6, 7, 8] ]
df_sub.head(2)

   Stu_ID  grade  Math  English  Science  Marketing  Writing
0   10101      1    55       84       50         40       59
1   10102      1    29       94       41         87       57

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [39]:
df_score_avg = pd.DataFrame({"Stu_ID": df_sub["Stu_ID"],
                            "Score_mean": df_sub.iloc[:, 2:].mean(axis = 1)})
df_score_avg.head(2)

   Stu_ID  Score_mean
0   10101        57.6
1   10102        61.6

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [46]:
score_max = df_sub.iloc[:, 2:].max()
score_min = df_sub.iloc[:, 2:].min()
score_std = df_sub.iloc[:, 2:].std()

score_stat = pd.DataFrame({"subject": df_sub.columns[2:],
                           "score_max": score_max,
                           "score_min": score_min,
                           "score_std": score_std})
score_stat

             subject  score_max  score_min  score_std
Math            Math        100         25  21.962645
English      English        100         25  21.187610
Science      Science        100         25  22.363775
Marketing  Marketing        100         25  21.993994
Writing      Writing        100         25  21.957905

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [47]:
score_stat = score_stat.reset_index(drop = True)
score_stat

     subject  score_max  score_min  score_std
0       Math        100         25  21.962645
1    English        100         25  21.187610
2    Science        100         25  22.363775
3  Marketing        100         25  21.993994
4    Writing        100         25  21.957905

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [48]:
score_stat.to_csv("score_stat.csv", index = False)